// --створити масив та вивести його в консоль:
//     - з 5 числових значень
//
//
// let numbers = [1, 2, 3, 4, 5,];
// console.log(numbers);
//
//
// - з 5 стічкових значень
//
//
//
//
// let string = ['home', 'strit', 'room', 'human'];
// console.log(string);
//
//
//
//
// - з 5 значень стрічкового, числового та булевого типу
//
//
//
//
// let bull = [1, 2, 3, 'number', true, false];
// console.log(bull);
//
//
//
//
//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//
// let someArey = [];
// someArey[0] = 'asd';
// someArey[1] = 'qwe';
// someArey[3] = 'zxc';
// someArey[4] = 123;
// someArey[5] = 321;
// console.log(someArey);
//
//
//
//
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
//
// for (i = 0; i < 10; i++) {
//     document.write('<div>qwerty</div>');
// }
//
//
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
//
//
// for (i = 0; i < 10; i++) {
//     document.write(`<div>qwerty ${i}</div>`);
// }
//
//
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
//
//
//     let i = 0;
// while (i < 20) {
//     document.write('<h1>I said good day sir!</h1>');
//     i++;
// }
//
//
//
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
//
//     let i = 0;
// while (i < 20) {
//     document.write(` <h1>I said good day sir! ${i}</h1>`);
//     i++;
// }
//
//
//
//
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
//
//     let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }
//
//
//
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
//
//     let arr = [ 'for', 'five', 'six', 'one', 'two','for', 'five', 'six', 'one', 'two',];
// for (i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }
//
//
//
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//
//     let arr = [1, 2, 3, 'for', 'five', 'six', true, false, 9, 10];
// for (i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }
//
//
//
//
//
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
//
//
// let arr = [1, 2, 3, 'for', 'five', 'six', true, false, true, false];
//
// for (const x of arr) {
//     if ( typeof x == "boolean"){
//         console.log(x);
//     }
// }
//
//
//
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
//
//
// let arr = [1, 2, 3, 'for', 'five', 'six', true, false, true, false];
//
// for (const x of arr) {
//     if (typeof x == 'string') {
//         console.log(x);
//     }
// }
//
//
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// let arr = [1, 2, 3, 'for', 'five', 'six', true, false, true, false];
//
// for (const x of arr) {
//     if (typeof x == 'boolean') {
//         console.log(x);
//     }
// }
//
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
//
//
//     let arr = [];
// arr[0]= 1;
// arr[1]= 2;
// arr[2]= 3;
// arr[3]= 'qwe';
// arr[4]= 'asd';
// arr[5]= 'zxc';
// arr[6]= true;
// arr[7]= false;
// arr[8]= 123;
// arr[9]= 'master';
// console.log(arr);
//
//
//
//
//
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//
// for (i = 0; i < 100; i += 2) {
//     console.log(i);
//     document.write(`${i} <br>`);
// }
//
//
//
//
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//
// for (i = 0; i < 100; i++) {
//     if (i % 2 !== 0) {
//         console.log(i);
//         document.write(`${i} <br>`);
//     }
// }
//
//
//
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
// for (i = 0; i < 100; i++) {
//     if (i % 2 == 0) {
//         console.log(i);
//         document.write(`${i} <br>`);
//     }
// }
//
//
//
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
//
// for (m = 0; m < 60; m++) {
//     for (s = 0; s < 60; s++) {
//         if (m === 0 && s === 0) {
//             document.write(`<div>${m} min ${s} sec</div>`);
//         } else if (m <= 1 && s < 60) {
//             document.write(`<div>${m} min ${s} sec</div>`);
//         }   else if ( m ===2 && s ===0){
//             document.write(`<div>${m} min ${s} sec</div>`);
//         }
//     }
// }
//
//
//
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
//
//
//
// for (h = 0; h <= 2; h++) {
//     for (m = 0; m < 60; m++) {
//         for (s = 0; s < 60; s++) {
//             if (h === 0 && m === 0 && s === 0) {
//                 document.write(`<div>${h} hour ${m} min ${s} sec</div>`);
//             } else if (h === 0) {
//                 document.write(`<div>${h} hour ${m} min ${s} sec</div>`);
//             } else if (h <= 2 && m < 20 && s < 60) {
//                 document.write(`<div>${h} hour ${m} min ${s} sec</div>`);
//             } else if (h === 2 && m === 20 && s === 0) {
//                 document.write(`<div>${h} hour ${m} min ${s} sec</div>`);
//             }
//         }
//     }
// }
//
//
//
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
//
//     let word = ['a', 'b', 'c'];
// for (i = 0; i < 3; i++){
//     document.write(word[i]);
// }
//
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
//
//
//
//     let i = 0;
// let word = ['a', 'b', 'c'];
// while (i < word.length){
//     document.write(word[i]);
//     i++;
// }
//
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//
//     let word = [ 'a', 'b', 'c'];
// for (const abcWord of word){
//     document.write(abcWord);
// }
//
//
//
//
// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
//
//     let arr = ['a', 'b', 'c'];
// for ( i = 0; i < 3; i++){
//     arr.push(`${i + 1}`);
// }
// console.log(arr);
//
//
//
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
//
//     let arr = [1,2,3];
// arr = [3,2,1];
// console.log(arr);
//
//
//
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
//
// let arr = [1,2,3];
// arr.push(4,5,6);
// console.log(arr);
//
//
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
//
// let arr = [1,2,3];
// arr.unshift(4,5,6);
// console.log(arr);
//
//
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
//
// let arr = ['js', 'css', 'jq'];
// console.log(arr.shift(arr));
//
//
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
//
// let arr = ['js', 'css', 'jq'];
// console.log(arr.pop(arr));
//
//
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1, 4, 5].
//
//     let numbers = [1, 2, 3, 4, 5];
// numbers.splice(1,2);
// console.log(numbers);
//
//
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
//
//
//     let numbers = [1, 2, 3, 4, 5];
// numbers.splice(0,3);
// console.log(numbers);
//
//
//
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
//
//     let numbers = [1, 2, 3, 4, 5];
// numbers.splice(2,3);
// console.log(numbers);
//
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//
//     let numbers = [1, 2, 3, 4, 5];
// numbers.splice(3,0, 'a', 'b', 'c',);
// console.log(numbers);
//
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//
//     let numbers = [1, 2, 3, 4, 5];
// numbers.splice(1,0, 'a', 'b', );
// numbers.splice(6,0,  'c',);
// numbers.splice(8,0,  'e',);
// console.log(numbers);
//
//
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
//
//     let arr = [1,2,3,4,5,6,7,8,9,10];
// for ( i = 0; i < arr.length; i++){
//     if (i % 2 !== 0) {
//         console.log(arr[i])
//     }
// }
//
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
//
// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let arr2 = []
// for (i = 0; i < arr.length; i++) {
//
//     arr2.push(arr[i])
//
// }
// console.log(arr2);
// console.log(arr);
//
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//     let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// let arr2 = []
// for (i = 0; i < arr.length; i++) {
//     arr2 = arr;
// }
// console.log(arr2);
// console.log(arr);
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//
//     i=0;
// while (i < arr.length){
//     console.log(arr[i]);
//     i++;
// }
//
// 2. перебрати його циклом for
//
//     for ( i = 0; i < arr.length; i++){
//         console.log(arr[i]);
//     }
//
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
// i = 0;
// while (i < arr.length) {
//     if (i % 2 === 0) {
//         console.log(arr[i]);
//     }
//     i++;
// }
//
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// for (i = 0; i < arr.length; i++) {
//     if (i % 2 === 0) {
//         console.log(arr[i]);
//     }
// }
//
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// while (i < arr.length) {
//     if (arr[i] % 2 !== 0) {
//         console.log(arr[i]);
//     }
//     i++;
// }
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// for (i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 !== 0) {
//         console.log(arr[i]);
//     }
// }
//
// 7. замінити кожне число кратне 3 на слово "okten"
//
// for (i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'okten';
//     }
//     console.log(arr[i]);
// }
//
// 8. вивести масив в зворотньому порядку.
//
//
// for (let i = arr.length - 1; i >= 0; i--) {
//     console.log(arr[i]);
// }
//
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
//
// for (let i = arr.length - 1; i >= 0; i--) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'okten';
//     }
//     console.log(arr[i]);
// }
//
//
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//     let arrUnpaired = [];
// let arrPair = [];
// let numUnpaired = 1;
// let numPair= 2;
// for (let i = 0; i < 50; i++) {
//     arrUnpaired[i] = numUnpaired;
//     arrPair[i] = numPair;
//     numUnpaired += 2;
//     numPair +=2;
//
// }
// console.log(arrUnpaired);
// console.log(arrPair);
//
//
//
//
//
// 1
// створити пустий масив та :
//     1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//
// let array = [];
// for (let i = 0; i < 50; i++) {
//     array[i] = Math.round(Math.random() * 732 - 8) + 8;
// }
// console.log(array);
//
//
//
//
// 2. вывести на консоль  каждый третий елемент
//
//
// for (let i = 0; i < array.length; i += 3) {
//     console.log(array[i]);
// }
//
//
// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
//
// for (let i = 0; i < array.length; i += 3) {
//     if  ( array[i] % 2 === 0){
//         console.log(array[i]);
//     }
//
// }
//
//
//
//
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
//
//
//     let otherArr = []
// for (let i = 0; i < array.length; i += 3) {
//     if  ( array[i] % 2 === 0){
//         console.log(array[i]);
//         otherArr.push(array[i])
//     }
// }
// console.log(otherArr);
//
//
//
//
//
//
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//
//
//
//     let arr = [];
// for (let i = 0; i < 50; i++) {
//     arr[i] = Math.round(Math.random() * 500);
// }
// console.log(arr);
//
// let newArr = [];
// for (let i = 0; i < arr.length; i++) {
//     arr[i] = arr[i] * 5;
//     newArr.push(arr[i])
// }
// console.log(newArr);
//
//
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
//
//     let asd = ['qwe', 123, 'asd', 321, true, 'Papa Karlo'];
// let numberAsd = [];
// for (const x of asd) {
//     if (typeof x == 'number') {
//         numberAsd.push(x);
//     }
// }
// console.log(numberAsd);